export type ProductType = {
  id:number,
  name:string,
  price:number,
  image:string,
  desc:string
};

let productsData = {
  laptop: [
    {
      id: 1,
      name: "Acer",
      price: 2_000,
      image: "/img/laptop/Acer.jpg",
      desc: "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز",
    },
    {
      id: 2,
      name: "Asus",
      price: 2_980,
      image: "/img/laptop/Asus.jpg",
      desc: "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز",
    },
    {
      id: 3,
      name: "Dell",
      price: 2_870,
      image: "/img/laptop/Dell.jpg",
      desc: "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز",
    },
    {
      id: 4,
      name: "Hp",
      price: 3_800,
      image: "/img/laptop/Hp.jpg",
      desc: "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز",
    },
    {
      id: 5,
      name: "Lenovo",
      price: 1_200,
      image: "/img/laptop/Lenovo.jpg",
      desc: "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز",
    },
  ],

  phone: [
    {
      id: 6,
      name: "GLXc58",
      price: 590,
      image: "/img/Cell Phone/GLXc58.jpg",
      desc: "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز",
    },
    {
      id: 7,
      name: "iphone13Apple",
      price: 4_200,
      image: "/img/Cell Phone/iphone13Apple.jpg",
      desc: "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز",
    },
    {
      id: 8,
      name: "notingPhone1",
      price: 1_500,
      image: "/img/Cell Phone/notingPhone1.jpg",
      desc: "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز",
    },
    {
      id: 9,
      name: "shiaomiRedmeNote12",
      price: 2000,
      image: "/img/Cell Phone/shiaomiRedmeNote12.jpg",
      desc: "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز",
    },
    {
      id: 10,
      name: "SumsungA14",
      price: 2_400,
      image: "/img/Cell Phone/SumsungA14.jpg",
      desc: "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز",
    },
  ],

  furniture: [
    {
      id: 11,
      name: "Laundry",
      price: 5_900,
      image: "/img/Furniture/Laundry.jpg",
      desc: "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز",
    },
    {
      id: 12,
      name: "Oven",
      price: 3_200,
      image: "/img/Furniture/Oven.jpg",
      desc: "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز",
    },
    {
      id: 13,
      name: "Refrigirator",
      price: 8_900,
      image: "/img/Furniture/Refrigirator.jpg",
      desc: "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز",
    },
    {
      id: 14,
      name: "TV",
      price: 5_700,
      image: "/img/Furniture/TV.jpg",
      desc: "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز",
    },
    {
      id: 15,
      name: "VaccumCleaner",
      price: 4_300,
      image: "/img/Furniture/VaccumCleaner.jpg",
      desc: "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز",
    },
  ],

  supermarket: [
    {
      id: 16,
      name: "Banana",
      price: 2.5,
      image: "/img/SuperMarket/Banana.jpg",
      desc: "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز",
    },
    {
      id: 17,
      name: "Keratin",
      price: 85,
      image: "/img/SuperMarket/Keratin.jpg",
      desc: "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز",
    },
    {
      id: 18,
      name: "PototoChips",
      price: 2,
      image: "/img/SuperMarket/PototoChips.jpg",
      desc: "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز",
    },
    {
      id: 19,
      name: "Rangarang",
      price: 5.9,
      image: "/img/SuperMarket/Rangarang.jpg",
      desc: "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز",
    },
    {
      id: 20,
      name: "rice",
      price: 7,
      image: "/img/SuperMarket/rice.jpg",
      desc: "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز",
    },
  ],
};

 const allProducts : ProductType[] = [
    ...productsData.laptop,
    ...productsData.phone,
    ...productsData.furniture,
    ...productsData.supermarket,
  ];

export default allProducts  ;

